## Time Series Analysis on Sale- Regression Model

# Business understanding

# Hypothesis

# 5 Analytic Question

In [137]:
%pip install pyodbc  
%pip install python-dotenv

Requirement already satisfied: pyodbc in c:\users\benedicta mankata\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (4.0.39)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.1.2 -> 23.2.1
[notice] To update, run: C:\Users\BENEDICTA MANKATA\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.11_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

Requirement already satisfied: python-dotenv in c:\users\benedicta mankata\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (1.0.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.1.2 -> 23.2.1
[notice] To update, run: C:\Users\BENEDICTA MANKATA\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.11_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [138]:
import pyodbc #just installed with pip
from dotenv import dotenv_values #import the dotenv_values function from the dotenv package
import pandas as pd

import warnings 

warnings.filterwarnings('ignore')

In [139]:
environment_variables = dotenv_values('.env')
    
database = environment_variables.get("DATABASE")
server = environment_variables.get("SERVER")
username = environment_variables.get("USERNAME")
password = environment_variables.get("PASSWORD")
    
connection_string = f"DRIVER={{SQL Server}};SERVER={server};DATABASE={database};UID={username};PWD={password}"
    
connection = pyodbc.connect(connection_string)

In [140]:
# extract data from Table 1: dbo.oil
# assign it to data1
# preview data1

query="Select * from dbo.oil" 
data1=pd.read_sql(query, connection)

data1.head()

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02   93.139999
2  2013-01-03   92.970001
3  2013-01-04   93.120003
4  2013-01-07   93.199997

In [141]:
data1.shape

(1218, 2)

In [142]:
#converting the  'date' column to datetime
data1['date'] = pd.to_datetime(data1['date'])

# Now the 'date' column contains datetime objects

In [143]:
# Save extracted data as data1.csv

data1.to_csv('data1.csv')

In [144]:
# extract data from Table 2: dbo.holidays_events
# assign it to data2
# preview data2

query2="Select * from dbo.holidays_events" 
data2=pd.read_sql(query2, connection)

data2.head()

,date,type,locale,locale_name,description,transferred
0,2012-03-02,Holiday,Local,Manta,Fundacion de Manta,False
1,2012-04-01,Holiday,Regional,Cotopaxi,Provincializacion de Cotopaxi,False
2,2012-04-12,Holiday,Local,Cuenca,Fundacion de Cuenca,False
3,2012-04-14,Holiday,Local,Libertad,Cantonizacion de Libertad,False
4,2012-04-21,Holiday,Local,Riobamba,Cantonizacion de Riobamba,False

In [145]:
data2.shape

(350, 6)

In [146]:
#converting the  'date' column to datetime
data2['date'] = pd.to_datetime(data2['date'])

# Now the 'date' column contains datetime objects

In [147]:
# Save extracted data as data2.csv

data2.to_csv('data2.csv')

In [148]:
# extract data from Table 3: dbo.stores
# assign it to data3
# preview data3

query3="Select * from dbo.stores" 
data3=pd.read_sql(query3, connection)

data3.head()

   store_nbr           city                           state type  cluster
0          1          Quito                       Pichincha    D       13
1          2          Quito                       Pichincha    D       13
2          3          Quito                       Pichincha    D        8
3          4          Quito                       Pichincha    D        9
4          5  Santo Domingo  Santo Domingo de los Tsachilas    D        4

In [149]:
# Save extracted data as data3.csv

data3.to_csv('data3.csv')

In [150]:
data_sub = pd.read_excel('E:/LP3 dataset/sample_submission.xlsx')

In [151]:
data_sub.head(5)

        id  sales
0  3000888      0
1  3000889      0
2  3000890      0
3  3000891      0
4  3000892      0

In [152]:
data_trans = pd.read_csv('E:/LP3 dataset/transactions.csv')

In [153]:
data_trans.head(5)

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [154]:
data_trans.shape

(83488, 3)

In [155]:
#converting the  'date' column to datetime
data_trans['date'] = pd.to_datetime(data_trans['date'])

# Now the 'date' column contains datetime objects

In [156]:
#displaying random sample of 5 rows
data_trans.sample(5,random_state=0)

            date  store_nbr  transactions
42686 2015-06-27         19          1680
32438 2014-11-27         28           936
40339 2015-05-11          4          1442
74167 2017-02-23         20          1543
28438 2014-09-05          3          3230

In [157]:
data_test= pd.read_excel('E:/LP3 dataset/test.xlsx')

In [158]:
data_test.head(5)

        id       date  store_nbr      family  onpromotion
0  3000888 2017-08-16          1  AUTOMOTIVE            0
1  3000889 2017-08-16          1   BABY CARE            0
2  3000890 2017-08-16          1      BEAUTY            2
3  3000891 2017-08-16          1   BEVERAGES           20
4  3000892 2017-08-16          1       BOOKS            0

In [159]:
data_test.shape

(28512, 5)

In [160]:
# setting data column as index 
data_test= data_test.set_index('date')
data_test.head()

                 id  store_nbr      family  onpromotion
date
2017-08-16  3000888          1  AUTOMOTIVE            0
2017-08-16  3000889          1   BABY CARE            0
2017-08-16  3000890          1      BEAUTY            2
2017-08-16  3000891          1   BEVERAGES           20
2017-08-16  3000892          1       BOOKS            0

In [161]:
# Convert the index to a DatetimeIndex
data_test.index = pd.to_datetime(data_test.index)

#use pandas time-based indexing to analyze data 
data_test['Year']= data_test.index.year
data_test['Month']= data_test.index.month
data_test['Day']= data_test.index.day
data_test['Weekday Name']= data_test.index.day_name()

In [162]:
#displaying random sample of 5 rows
data_test.sample(5,random_state=0)

,id,store_nbr,family,onpromotion,Year,Month,Day,Weekday Name
date,,,,,,,,
2017-08-22,3013178,53,HARDWARE,0,2017,8,22,Tuesday
2017-08-18,3005236,30,PERSONAL CARE,7,2017,8,18,Friday
2017-08-19,3007505,44,HOME APPLIANCES,0,2017,8,19,Saturday
2017-08-23,3014581,42,SCHOOL AND OFFICE SUPPLIES,0,2017,8,23,Wednesday
2017-08-17,3003896,43,BREAD/BAKERY,8,2017,8,17,Thursday

In [163]:
data_train= pd.read_csv('E:/LP3 dataset/train.csv')

In [164]:
data_train.head(5)

   id        date  store_nbr      family  sales  onpromotion
0   0  2013-01-01          1  AUTOMOTIVE    0.0            0
1   1  2013-01-01          1   BABY CARE    0.0            0
2   2  2013-01-01          1      BEAUTY    0.0            0
3   3  2013-01-01          1   BEVERAGES    0.0            0
4   4  2013-01-01          1       BOOKS    0.0            0

In [165]:
data_train.shape

(3000888, 6)

In [166]:
#converting the  'date' column to datetime
data_train['date'] = pd.to_datetime(data_train['date'])

# Now the 'date' column contains datetime objects

In [167]:
# setting data column as index 
data_train= data_train.set_index('date')
data_train.head()

            id  store_nbr      family  sales  onpromotion
date
2013-01-01   0          1  AUTOMOTIVE    0.0            0
2013-01-01   1          1   BABY CARE    0.0            0
2013-01-01   2          1      BEAUTY    0.0            0
2013-01-01   3          1   BEVERAGES    0.0            0
2013-01-01   4          1       BOOKS    0.0            0

In [168]:
# Convert the index to a DatetimeIndex
data_train.index = pd.to_datetime(data_train.index)

#use pandas time-based indexing to analyze data 
data_train['Year']= data_train.index.year
data_train['Month']= data_train.index.month
data_train['Day']= data_train.index.day
data_train['Weekday Name']= data_train.index.day_name()

In [169]:
#displaying random sample of 5 rows
data_train.sample(5,random_state=0)

,id,store_nbr,family,sales,onpromotion,Year,Month,Day,Weekday Name
date,,,,,,,,,
2014-02-28,752075,11,BREAD/BAKERY,450.0,0,2014,2,28,Friday
2016-11-16,2517272,39,SEAFOOD,8.0,1,2016,11,16,Wednesday
2016-11-29,2540112,30,BEVERAGES,1422.0,40,2016,11,29,Tuesday
2016-08-31,2379367,20,BABY CARE,1.0,0,2016,8,31,Wednesday
2014-01-30,700715,2,PET SUPPLIES,8.0,0,2014,1,30,Thursday

In [170]:
data_trans.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  datetime64[ns]
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: datetime64[ns](1), int64(2)
memory usage: 1.9 MB

In [171]:
data_sub.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28512 entries, 0 to 28511
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      28512 non-null  int64
 1   sales   28512 non-null  int64
dtypes: int64(2)
memory usage: 445.6 KB

In [172]:
data_train.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 3000888 entries, 2013-01-01 to 2017-08-15
Data columns (total 9 columns):
 #   Column        Dtype
---  ------        -----
 0   id            int64
 1   store_nbr     int64
 2   family        object
 3   sales         float64
 4   onpromotion   int64
 5   Year          int32
 6   Month         int32
 7   Day           int32
 8   Weekday Name  object
dtypes: float64(1), int32(3), int64(3), object(2)
memory usage: 194.6+ MB

In [173]:
data_test.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 28512 entries, 2017-08-16 to 2017-08-31
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            28512 non-null  int64
 1   store_nbr     28512 non-null  int64
 2   family        28512 non-null  object
 3   onpromotion   28512 non-null  int64
 4   Year          28512 non-null  int32
 5   Month         28512 non-null  int32
 6   Day           28512 non-null  int32
 7   Weekday Name  28512 non-null  object
dtypes: int32(3), int64(3), object(2)
memory usage: 1.6+ MB

In [174]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1218 non-null   datetime64[ns]
 1   dcoilwtico  1175 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 19.2 KB

In [175]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 350 entries, 0 to 349
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         350 non-null    datetime64[ns]
 1   type         350 non-null    object
 2   locale       350 non-null    object
 3   locale_name  350 non-null    object
 4   description  350 non-null    object
 5   transferred  350 non-null    bool
dtypes: bool(1), datetime64[ns](1), object(4)
memory usage: 14.1+ KB

In [176]:
data3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54 entries, 0 to 53
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   store_nbr  54 non-null     int64
 1   city       54 non-null     object
 2   state      54 non-null     object
 3   type       54 non-null     object
 4   cluster    54 non-null     int64
dtypes: int64(2), object(3)
memory usage: 2.2+ KB

In [177]:
data1.isna().sum()

date           0
dcoilwtico    43
dtype: int64

In [178]:
data2.isna().sum()

date           0
type           0
locale         0
locale_name    0
description    0
transferred    0
dtype: int64

In [179]:
data3.isna().sum()

store_nbr    0
city         0
state        0
type         0
cluster      0
dtype: int64

In [180]:
data_trans.isna().sum()

date            0
store_nbr       0
transactions    0
dtype: int64

In [181]:
data_test.isna().sum()

id              0
store_nbr       0
family          0
onpromotion     0
Year            0
Month           0
Day             0
Weekday Name    0
dtype: int64

In [182]:
data_sub.isna().sum()

id       0
sales    0
dtype: int64

In [183]:
data_train.isna().sum()

id              0
store_nbr       0
family          0
sales           0
onpromotion     0
Year            0
Month           0
Day             0
Weekday Name    0
dtype: int64

In [184]:
print(data1.columns)
print(data2.columns)
print(data3.columns)

Index(['date', 'dcoilwtico'], dtype='object')
Index(['date', 'type', 'locale', 'locale_name', 'description', 'transferred'], dtype='object')
Index(['store_nbr', 'city', 'state', 'type', 'cluster'], dtype='object')

In [185]:
# Convert 'date' columns to datetime
data1['date'] = pd.to_datetime(data1['date'])
data2['date'] = pd.to_datetime(data2['date'])


# Merge data1 and data2 on the 'date' column
merged_df = data1.merge(data2, on='date', how='left')

# Merge the result with data3 on the 'date' column
data = merged_df.merge(data3, on='type', how='outer')

print(data)

           date  dcoilwtico     type    locale locale_name  \
0    2013-01-01         NaN  Holiday  National     Ecuador
1    2013-02-11   97.010002  Holiday  National     Ecuador
2    2013-02-12   97.480003  Holiday  National     Ecuador
3    2013-04-01   97.099998  Holiday  Regional    Cotopaxi
4    2013-04-12   91.230003  Holiday     Local      Cuenca
...         ...         ...      ...       ...         ...
1285        NaT         NaN        A       NaN         NaN
1286        NaT         NaN        A       NaN         NaN
1287        NaT         NaN        A       NaN         NaN
1288        NaT         NaN        A       NaN         NaN
1289        NaT         NaN        A       NaN         NaN

                        description transferred  store_nbr       city  \
0                Primer dia del ano       False        NaN        NaN
1                          Carnaval       False        NaN        NaN
2                          Carnaval       False        NaN        NaN
3     Provincializacion de Cotopaxi       False        NaN        NaN
4               Fundacion de Cuenca       False        NaN        NaN
...                             ...         ...        ...        ...
1285                            NaN         NaN       48.0      Quito
1286                            NaN         NaN       49.0      Quito
1287                            NaN         NaN       50.0     Ambato
1288                            NaN         NaN       51.0  Guayaquil
1289                            NaN         NaN       52.0      Manta

           state  cluster
0            NaN      NaN
1            NaN      NaN
2            NaN      NaN
3            NaN      NaN
4            NaN      NaN
...          ...      ...
1285   Pichincha     14.0
1286   Pichincha     11.0
1287  Tungurahua     14.0
1288      Guayas     17.0
1289      Manabi     11.0

[1290 rows x 11 columns]

In [186]:
data.head(5)

,date,dcoilwtico,type,locale,locale_name,description,transferred,store_nbr,city,state,cluster
0,2013-01-01,NaN,Holiday,National,Ecuador,Primer dia del ano,False,NaN,NaN,NaN,NaN
1,2013-02-11,97.010002,Holiday,National,Ecuador,Carnaval,False,NaN,NaN,NaN,NaN
2,2013-02-12,97.480003,Holiday,National,Ecuador,Carnaval,False,NaN,NaN,NaN,NaN
3,2013-04-01,97.099998,Holiday,Regional,Cotopaxi,Provincializacion de Cotopaxi,False,NaN,NaN,NaN,NaN
4,2013-04-12,91.230003,Holiday,Local,Cuenca,Fundacion de Cuenca,False,NaN,NaN,NaN,NaN

In [187]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1290 entries, 0 to 1289
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         1236 non-null   datetime64[ns]
 1   dcoilwtico   1190 non-null   float64
 2   type         256 non-null    object
 3   locale       202 non-null    object
 4   locale_name  202 non-null    object
 5   description  202 non-null    object
 6   transferred  202 non-null    object
 7   store_nbr    54 non-null     float64
 8   city         54 non-null     object
 9   state        54 non-null     object
 10  cluster      54 non-null     float64
dtypes: datetime64[ns](1), float64(3), object(7)
memory usage: 111.0+ KB

In [188]:
# Convert the index to a DatetimeIndex
data.index = pd.to_datetime(data.index)

#use pandas time-based indexing to analyze data 
data['Year']= data.index.year
data['Month']= data.index.month
data['Day']= data.index.day
data['Weekday Name']= data.index.day_name()

In [189]:
data.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1290 entries, 1970-01-01 00:00:00 to 1970-01-01 00:00:00.000001289
Data columns (total 15 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          1236 non-null   datetime64[ns]
 1   dcoilwtico    1190 non-null   float64
 2   type          256 non-null    object
 3   locale        202 non-null    object
 4   locale_name   202 non-null    object
 5   description   202 non-null    object
 6   transferred   202 non-null    object
 7   store_nbr     54 non-null     float64
 8   city          54 non-null     object
 9   state         54 non-null     object
 10  cluster       54 non-null     float64
 11  Year          1290 non-null   int32
 12  Month         1290 non-null   int32
 13  Day           1290 non-null   int32
 14  Weekday Name  1290 non-null   object
dtypes: datetime64[ns](1), float64(3), int32(3), object(8)
memory usage: 146.1+ KB

In [190]:
data.isnull().sum()

date              54
dcoilwtico       100
type            1034
locale          1088
locale_name     1088
description     1088
transferred     1088
store_nbr       1236
city            1236
state           1236
cluster         1236
Year               0
Month              0
Day                0
Weekday Name       0
dtype: int64

In [191]:
# checking if there is any duplicate
# now that we have confirmed that there are no outliers, lets look at the duplicates
print("Number of duplicates in train dataset:", data.duplicated().sum())

Number of duplicates in train dataset: 0

Plotting the time series data to visualize trends, seasonality, and patterns